Revit 2027 API
TrussChordLocation Enumeration
 This enumerated type represents the options for the Truss Chord Location.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TrussChordLocation
Public Enumeration TrussChordLocation
public enum class TrussChordLocation
type TrussChordLocation
Members
Member name | Value | Description
Bottom | 0 |  The bottom chord of the Truss.
Top | 1 |  The top chord of the Truss.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace